In [18]:
import pandas as pd
import seaborn as sns
import numpy as np

tips = sns.load_dataset("tips")

In [19]:
#Взглянем на данные
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [20]:
#1)Выведем количество столбцов и строк
tips.shape

(244, 7)

In [21]:
#2)Вывести название третьего столбца
tips.columns[2]

'sex'

In [22]:
#4)DataFrame total_bill < 15
bill_15 = tips[tips['total_bill'] < 15]
bill_15.head()

    total_bill   tip     sex smoker  day    time  size
1        10.34  1.66    Male     No  Sun  Dinner     3
6         8.77  2.00    Male     No  Sun  Dinner     2
9        14.78  3.23    Male     No  Sun  Dinner     2
10       10.27  1.71    Male     No  Sun  Dinner     2
14       14.83  3.02  Female     No  Sun  Dinner     2

In [23]:
#5)Df из чаевых по субботам 
tip_Sat = tips[tips['day']=='Sat'][['tip', 'day']]
tip_Sat.head()

     tip  day
19  3.35  Sat
20  4.08  Sat
21  2.75  Sat
22  2.23  Sat
23  7.58  Sat

In [24]:
#6)Суммарные чаевые по дням недели
tips.groupby('day')['tip'].sum()

day
Thur    171.83
Fri      51.96
Sat     260.40
Sun     247.39
Name: tip, dtype: float64

In [25]:
#7)создать DataFrame, в котором столбцами будут названия дней недели, данные – суммарный размер
#чаевых, строки – курящие мужчины, некурящие мужчины, курящие женщины, некурящие женщины;
table = pd.pivot_table(tips, values='tip', index=['sex', 'smoker'], columns='day', aggfunc=np.sum)
table.head()

day             Thur    Fri     Sat     Sun
sex    smoker
Male   Yes     30.58  21.93   77.74   52.82
       No      58.83   5.00  104.21  133.96
Female Yes     20.93  18.78   43.03   14.00
       No      61.49   6.25   35.42   46.61